
// 穴埋め形式です。空いている箇所を埋めて実装してください

$(function () {
  /*=================================================
  ハンバーガ―メニュー
  ===================================================*/
  // ハンバーガーメニューをクリックした時
  $("").on("click", function () {
    // ハンバーガーメニューの共通処理を呼び出す
    hamburger();
  });
  // メニューのリンクをクリックした時
  $("").on("click", function () {
    // ハンバーガーメニューの共通処理を呼び出す
    hamburger();
  });

  /*=================================================
  Inview（画面に表示されたタイミングで処理を実行）
  ===================================================*/
  $("").on("inview", function (event, isInView, visiblePartX, visiblePartY) {
    if (isInView) {
      $(this).addClass("");
    } else {
      $(this).removeClass("");
    }
  });
  
});

// これを複数使う

/*=================================================
ハンバーガ―メニュー共通処理
===================================================*/
function hamburger() {
  
  $("").toggleClass("");

  $("").toggleClass("");
}
